<script setup lang="ts">

import {useCurrentFanficView} from "@/stores/counter";
let Fanfics= [{
  id: 1,
  title: 'Лидер группировки Симэн Жуков.',
  description: 'Представляю вам новейшую штурмовую дивизию морпехов наёмников "Адские псы"\n' +
      'Лидер группировки Симэн Жуков. Бывший наёмник предводительницы Миры. Поступил на службу в штурмовой отряд "Рейдоров Рейнара" После отправлен на Чар для несение службы и дальнейшим захватом планеты.\n' +
      'Получил 3 медали за ход операции спасательных шлюпок во время высадки на Чаре" Перед боевым вылетом лично один из первых морпехов сел в шлюпку и десантировался на Чар. В ходе посадки шлюпки она была сбита споровой колонией зергов! Но Жуков не растерялся и выпрыгнул из шлюпки! Включив при этом ракетный ранец и приземлившись прям на голову зерглинга. Вскоре он повстречает Евгения Рогонова и его команду.\n' +
      'Вскоре повышен до Мл.лейтенанта и выдан полномочиями на создание собственной группировки.\n' +
      'Вскоре он повстречает настоящих героев ,которые будут сопровождать его в группировки "Адские псы" Но... он ещё не знает... каких бойцов.....',
  image: "/src/components/icons/Zhukov.jpg",
},
{
  id: 2,
  title: 'Заместитель лидера группировки Евгений Рогонов. Позывной "Джин"',
  description: 'Заместитель лидера группировки Евгений Рогонов. Позывной "Джин"\n' +
      'В прошлом много пил и употреблял наркотические вещества. Был женат на женщине пожилого возраста, вскоре после смерти супруги пропил всё имущество, и пошел на фронт в надежде заработать славу и кредитов.\n' +
      'Вскоре по службе был направлен на чар в одной штурмовой десантной дивизии что и Жуков\n' +
      'В ходе операции стоял плечом к плечу с их нынешним лидерам Жуковым во время операции спасение. В ходе операции Жуков и Евгений попали в кольцо ,и были окружены роям зергов, и в один момент на Евгения напал Гидралиск, связав его в ближнем бою. В ходе не долгой драки, не на жизнь, а на смерть, Евгений будучи в сильном алкогольном опьянении, бливанул прямо на рожу Гидралиску. Перед этим за долго до операции выпив 2 бутылки джина. Гидралиск потерял зрение и Евгений одним мощным ударом железной рукой скафандра вырубает наглую тварь. После операции Жуков вспоминает что Евгений был в баре за долго до операции, и получает позывной "Джин"\n' +
      'Вскоре присоединился к группировки Адские псы.',
  image: "/src/components/icons/Rogonov.png",
},
{
  id: 3,
  title: 'Владислав Чушпанов.\n' +
      'Третий и бесстрашный член группировки "Адские псы"',
  description: 'Владислав Чушпанов.\n' +
      'Третий и бесстрашный член группировки "Адские псы"\n' +
      'В прошлом жил на планете "Чушпун", решил пойти добровольцем-новобранцам на штурм планеты Чар и после битвы получил звание мл.Сержант.\n' +
      'Владислав Чушпанов вместе с его отрядом штурмовали пещеры "Червей Нидуса". В ходе затяжной битвы Владислав Чушпанов убил одну из королев роя, и боевым ножом срубил один из клыков и оставил себе как трофей. После выхода из пещер.. прошло несколько часов прежде чем ему дали новый приказ вместе с его отрядом.\n' +
      'В ходе операции "Спасение" на Чаре в разгар битвы получил позывной "Бесстрашный" В ходе операции Влад Чушпанов держал оборону во время зарядки Артефакта, под нападением самой Королевы Клинков.\n' +
      'В ходе получил ранение в колено иглой Гидралиска и был отправлен на эвакуационный шатал обратно на Кархал после победы над Королевой Клинков.\n' +
      'Вскоре присоединится к группировки "Адские псы" когда встретит Евгения Рогонина в баре "У Джория" на Марсаре',
  image: "/src/components/icons/Vlad.jpg",
},
{
  id: 4,
  title: 'Даниил Гнездоволыкин.\n' +
      '4й и не последний член группировки "Адские псы""',
  description: 'Даниил Гнездоволыкин.\n' +
      '4й и не последний член группировки "Адские псы"\n' +
      'Сержант повстанческой группировки против режима Арктура Менгска "Рейдары Рейнора" В прошлом был арестован за убийство 7 человек  в баре "Гиена" Отбывал срок в тюрьме "Новый заход" в морозильной камере 4 года, после был нанят на службу принудительно и экипирован в скафандр морпеха. Через 6 месяцев был отправлен к флоту Валерия Менгска.  В ходи операции по защите Артефакта был на одном оборонительном рубеже что и Владислав Чушпанов. В разгаре битвы из-за своей косоглазости ,при наступлении зергов ослеплённый ярким светом вспышки Артефакта, шмальнул Владиславу Чушпанову в колено, в тот же момент летящий во Владислава Чушпанова прилетает бейлинг, обливая его кислотой, но благо не задев нужные органы и Владислав Чушпанов отрубается от шока. Вскоре был эвакуирован на Медэваке.\n' +
      'Он так и не знает что его колено повредил вовсе не Гидралиск...\n' +
      'В скором времени Даниил Гнездовалыкин встретит Владислава Чушпанова на службе на космическом корабле "Гепереон"\n' +
      'Но это уже другая история... ',
  image: "/src/components/icons/ALkash.jpg",
},
{
  id: 5,
  title: 'Илья Чухан.\n' +
      '5й член отряда "Адские псы"',
  description: 'Илья Чухан.\n' +
      '5й член отряда "Адские псы"\n' +
      'Бывших глава разведывательного отряда, группировки "Рейдоры Рейнора" \n' +
      'Был снять за некомпетентность по отношению к личному составу и средствам гигиены.\n' +
      'Перед началом операции он провёл инструктаж новобранцам пере**д** штурмом планеты Чар. Он лично расстрелял 2 солдат стоявших рядом с Владиславом Чушпановым и к сожалению не попадая в него. У Владислава Чушпанова пошёл пот от увиденного и от выражения лица Ильи Чухана.. Он закрыл глаза и про себя подумал "Вот бы эта гнида сдохла..\n' +
      'Вскоре после вылета он встречает Жукова... И тяжело дышавшего и ели ели стоявшего  на ногах Евгения Рогонова.. Он... зная какие подвиги совершил Симэн Жуков, моментально побежал к ним на встречу и оттащил облёванного Евгения Рогонова в ближайший бункер. \n' +
      'После кровавой РЕЗНИ... когда на поле боя были слышаны лишь крики душ умерших бойцов. Илья Чуханов сказал "Прости меня боже за мои грехи" После всего что он испытал на этом поле боя, он стал жить честной жизнью.\n' +
      'И вскоре! КОНЕЧНО же повстречал Евгения Рогонина пьяного в хлам в стриптиз клубе.\n' +
      'А вскоре Евгений познакомил его с Жуковым и пригласил его в его в группировку "Адские псы"',
  image: "/src/components/icons/LOH.jpg",
},
  {
    id:6,
    title: "Дарья Андерсон.\n" +
        "6й член отряда \"Адские псы\"",
    description: "Дарья Андерсон.\n" +
        "6й член отряда \"Адские псы\"\n" +
        "Глава исследовательской группы изучение ДНК зергов.\n" +
        "Перед началом высадки на Чар, Дарья Андерсон посетила исследовательскую лабораторию на Геперионе. Где взяла образец Пси-Излучателя, после этого направившись в бар. В баре она встретила: Владислава Чушпанова и Евгения Рогонина.\n" +
        "Евгений Рогонин был уже в хлам, а Владислав Чушпанов пил \"Маджанское\". Увидев всю картину целиком ,она вышла из бара в надежде увидеть хоть что-то здравое на этом корабле.\n" +
        "Поднявшись к ангару ,где находились шлюпки и десантные капсулы ..Она увидела как проводит инструктаж Илья Чуханов.\n" +
        "Поняла что дело пахнет жареным, она удалилась в лабораторию и следила за развитием событий на Чаре во время штурма. Вскоре она получала повышение за управление \"Медэваком на чаре и спасение около 130 раненых бойцов. Пока шла битва... Дарья Андерсон мастерски управляла космическим кораблём. За что получила позывной \"Водила\"\n" +
        "Во время операции \"Спасение\" приняла на борт корабля: Симэна Жукова, в хлам бухого Евгения Рогоного, Раненого в колено и облитого кислотой Владислава Чушпанова, и косоглазого Даниила Гнездоволыкина.\n" +
        "Вскоре она присоединится к группировки \"Адские псы\" Как лучший пилот и \"Водила\" Медэвека. ",
    image: "/src/components/icons/TP.jpg",
  }
]

</script>

<template>

<section>
  <div class="container-xxl">
    <div class="row align-items-center">
      <div class="col-7">
        <h1>{{Fanfics[useCurrentFanficView().id -1 ].title}}</h1>
      </div>
      <div class="col-5">
        <img :src="Fanfics[useCurrentFanficView().id -1 ].image" class="w-100" alt=""/>
      </div>
    </div>
  </div>
</section>

<section>
  <div class="container-xxl">
    <div class="row align-items-center">
      <div class="col-7">
        <p>{{Fanfics[useCurrentFanficView().id -1 ].description}}</p>
      </div>
    </div>
  </div>
</section>

</template>

